{
    "Recipes": [
        {
            "Recipe": {
                "name": "Chocolate Blackout Cake",
                "description": "Delicious chocolate cake.",
                "category": "Desert",
                "prep_time": "",
                "cook_time": "",
                "servings": "10 to 12",
                "notes": "Be sure to give the pudding and the cake enough time to cool or you'll end up with runny pudding and gummy cake. The cake can be refrigerated for up to 2 days."
            },
            "Ingredient": [
                {
                    "name": "3 3\/4 cups granulated sugar",
                    "for": "Pudding"
                },
                {
                    "name": "3\/4 cup cornstarch",
                    "for": "Pudding"
                },
                {
                    "name": "1\/2 teaspoon table salt",
                    "for": "Pudding"
                },
                {
                    "name": "6 cups half-and-half",
                    "for": "Pudding"
                },
                {
                    "name": "3 cups whole milk",
                    "for": "Pudding"
                },
                {
                    "name": "18 ounces unsweetened chocolate, chopped",
                    "for": "Pudding"
                },
                {
                    "name": "6 teaspoons vanilla extract",
                    "for": "Pudding"
                },
                {
                    "name": "8 tablespoons unsalted butter, plus extra for pans",
                    "for": "Cake"
                },
                {
                    "name": "1 1\/2 cups unbleached all-purpose flour, plus extra for pans",
                    "for": "Cake"
                },
                {
                    "name": "2 teaspoons baking powder",
                    "for": "Cake"
                },
                {
                    "name": "1\/2 teaspoon baking soda",
                    "for": "Cake"
                },
                {
                    "name": "1\/2 teaspoon table salt",
                    "for": "Cake"
                },
                {
                    "name": "3\/4 cup Dutch-processed cocoa",
                    "for": "Cake"
                },
                {
                    "name": "1 cup brewed coffee",
                    "for": "Cake"
                },
                {
                    "name": "1 cup buttermilk",
                    "for": "Cake"
                },
                {
                    "name": "1 cup packed light brown sugar",
                    "for": "Cake"
                },
                {
                    "name": "1 cup granulated sugar",
                    "for": "Cake"
                },
                {
                    "name": "2 large eggs",
                    "for": "Cake"
                },
                {
                    "name": "1 teaspoon vanilla extract",
                    "for": "Cake"
                }
            ],
            "Direction": [
                {
                    "step": "For the pudding: Whisk sugar, cornstarch, salt, half-and-half, and milk in large saucepan. Set pan over medium heat. Add chocolate and whisk constantly until chocolate melts and mixture begins to bubble, 2 to 4 minutes. Stir in vanilla and transfer pudding to large bowl. Place plastic wrap directly on surface of pudding and refrigerate until cold, at least 4 hours or up to 1 day.",
                    "step_number": "1",
                    "for": ""
                },
                {
                    "step": "For the cake: Adjust oven rack to middle position and heat oven to 325 degrees. Butter and flour two 8-inch cake pans. Whisk flour, baking powder, baking soda, and salt in bowl.",
                    "step_number": "2",
                    "for": ""
                },
                {
                    "step": "Melt butter in large saucepan over medium heat. Stir in cocoa and cook until fragrant, about 1 minute. Off heat, whisk in coffee, buttermilk, and sugars until dissolved. Whisk in eggs and vanilla, then slowly whisk in flour mixture.",
                    "step_number": "3",
                    "for": ""
                },
                {
                    "step": "Divide batter evenly between prepared pans and bake until toothpick inserted in center comes out clean, 30 to 35 minutes. Cool layers in pans 15 minutes, then invert onto wire rack. Cool to room temperature, at least 1 hour.",
                    "step_number": "4",
                    "for": ""
                },
                {
                    "step": "To assemble: Cut each cake in half horizontally. Crumble 1 cake layer into medium crumbs and set aside. place 1 cake layer on serving platter or cardboard round. Spread 1 cup pudding over cake and top with another layer. Repeat with 1 cup pudding and last layer. Spread remaining pudding over top and sides of cake and coat with reserved crumbs. Serve.",
                    "step_number": "5",
                    "for": ""
                }
            ]
        },
        {
            "Recipe": {
                "name": "Pear-Hazelnut Crisp",
                "description": "This is a great fall recipe to make with children. The kids can help peel the fruit; then, while you core and slice it, have the kids blend the ingredients for the hazelnut topping together with their fingers. They love that step.",
                "category": "Desert",
                "prep_time": "",
                "cook_time": "",
                "servings": "",
                "notes": "To skin hazelnuts, spread them on a rimmed baking sheet. Bake in a 350 degree oven for 10-15 minutes, until the skins have cracked. While the nuts are still quite hot, transfer to a dish towel; fold or close over the towel and rub vigorously to dislodge the skins. (This will make a mess.)"
            },
            "Ingredient": [
                {
                    "name": "6 ripe pears, peeled, cored, and cut into medium dice",
                    "for": "Filling"
                },
                {
                    "name": "2 teaspoons freshly squeezed lemon joice",
                    "for": "Filling"
                },
                {
                    "name": "1\/4 cup packed light brown sugar",
                    "for": "Filling"
                },
                {
                    "name": "2 tablespoons flour",
                    "for": "Filling"
                },
                {
                    "name": "2 tablespoons water",
                    "for": "Filling"
                },
                {
                    "name": "1\/2 cup skinned hazelnuts, finely chopped",
                    "for": "Topping"
                },
                {
                    "name": "1 cup flour",
                    "for": "Topping"
                },
                {
                    "name": "6 tablespoons light brown sugar",
                    "for": "Topping"
                },
                {
                    "name": "Pinch ground cinnamon",
                    "for": "Topping"
                },
                {
                    "name": "Pinch kosher salt",
                    "for": "Topping"
                },
                {
                    "name": "6 tablespoons (3\/4 stick) unsalted butter, cut into small pieces",
                    "for": "Topping"
                },
                {
                    "name": "1 1\/2 cups chilled heavy whipping cream",
                    "for": "Whipped Cream"
                },
                {
                    "name": "1 teaspoon confectioners sugar, or to taste",
                    "for": "Topping"
                },
                {
                    "name": "1 teaspoon vanilla extract, or to taste",
                    "for": "Topping"
                }
            ],
            "Direction": [
                {
                    "step": "For the filling: Preheat the oven to 375 degrees. Place a large, 2-inch-deep baking dish or several smaller baking dishes on a baking sheet.",
                    "step_number": "1",
                    "for": ""
                },
                {
                    "step": "Combine the pears, lemon juice, brown sugar and flour in a large bowl, then pour the mixture into the baking dish(es). Sprinkle the surface with water.",
                    "step_number": "2",
                    "for": ""
                },
                {
                    "step": "For the topping: Combine the hazelnuts, flour, brown sugar, the cinnamon and salt in a separate bowl. Work the butter pieces in with your fingers to form a crumbly mixture, then scatter it over the surface of the pears, pressing lightly to fit it all in.",
                    "step_number": "3",
                    "for": ""
                },
                {
                    "step": "Bake (on the baking sheet) until golden brown and bubbly around the edges of the dish, about 45 minutes. Let stand for at least 10 minutes before serving.",
                    "step_number": "4",
                    "for": ""
                },
                {
                    "step": "While the crisp is in the oven, make the whipped cream: Whisk together the cream, sugar and vanilla extract in a clean metal bowl (preferably chilled) to form soft peaks. Cover and refrigerate until ready to use.",
                    "step_number": "5",
                    "for": ""
                },
                {
                    "step": "Serve each portion of the pear-hazelnut crisp with a dollop of the whipped cream.",
                    "step_number": "6",
                    "for": ""
                }
            ]
        }
    ]
}